#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	int a;
	cout << "Введите номер задания" << endl;
	cin >> a;
	switch (a) {
	case 1: {
		/*Дан номер дня – целое число от 1 до 31 и месяца — целое число в
		диапазоне 1–12(1 — январь, 2 — февраль и т.д.).Вывести дату в виде текста
		(например, «пятое января»).*/

		int a, b;
		cout << "Введите дату" << endl;
		cin >> a >> b;
		if (a <= 31 && a > 0 && b > 0 && b <= 12) {

			if (a == 1) { cout << "Первое" << endl; }
			if (a == 2) { cout << "Второе" << endl; }
			if (a == 3) { cout << "Третье" << endl; }
			if (a == 4) { cout << "Четвертое" << endl; }
			if (a == 5) { cout << "Пятое" << endl; }
			if (a == 6) { cout << "Шестое" << endl; }
			if (a == 7) { cout << "Седьмое" << endl; }
			if (a == 8) { cout << "Восьмое" << endl; }
			if (a == 9) { cout << "Девятое" << endl; }
			if (a == 10) { cout << "Десятое" << endl; }
			if (a == 11) { cout << "Одинадцатое" << endl; }
			if (a == 12) { cout << "Двенадцатое" << endl; }
			if (a == 13) { cout << "Тринадцатое" << endl; }
			if (a == 14) { cout << "Четырнадцатое" << endl; }
			if (a == 15) { cout << "Пятнадцатое" << endl; }
			if (a == 16) { cout << "Шестнадцатое" << endl; }
			if (a == 17) { cout << "Семнадцатое" << endl; }
			if (a == 18) { cout << "Восемнадцатое" << endl; }
			if (a == 19) { cout << "Девятнадцатое" << endl; }
			if (a == 20) { cout << "Двадцатое" << endl; }
			if (a == 21) { cout << "Двадцать первое" << endl; }
			if (a == 22) { cout << "Двадцать второе" << endl; }
			if (a == 23) { cout << "Двдацать третье" << endl; }
			if (a == 24) { cout << "Двадцать четвертое" << endl; }
			if (a == 25) { cout << "Двадцать пятое" << endl; }
			if (a == 26) { cout << "Двадцать шестое" << endl; }
			if (a == 27) { cout << "Двадцать седьмое" << endl; }
			if (a == 28) { cout << "Двадцать восьмое" << endl; }
			if (a == 29) { cout << "Двадцать девятое" << endl; }
			if (a == 30) { cout << "Тридцатое" << endl; }
			if (a == 31) { cout << "Тридцать первое" << endl; }


			if (b == 1) { cout << "Января" << endl; }
			if (b == 2) { cout << "Февраля" << endl; }
			if (b == 3) { cout << "Марта" << endl; }
			if (b == 4) { cout << "Апреля" << endl; }
			if (b == 5) { cout << "Мая" << endl; }
			if (b == 6) { cout << "Июня" << endl; }
			if (b == 7) { cout << "Июля" << endl; }
			if (b == 8) { cout << "Августа" << endl; }
			if (b == 9) { cout << "Сентября" << endl; }
			if (b == 10) { cout << "Октября" << endl; }
			if (b == 11) { cout << "Ноября" << endl; }
			if (b == 12) { cout << "Декабря" << endl; }

		}
		else {
			cout << "Такой даты нет))))0" << endl;
		}
	}
	case 2: {/*Робот может перемещаться в четырех направлениях(«С» — север, «З» — запад, «Ю» — юг, «В» — восток) и принимать три цифровые команды :
		0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.
		Дан символ C — исходное направление робота и целое число N — посланная ему команда.
		Вывести направление робота после выполнения полученной команды*/

		string C[4] = { "С","З","Ю","В" }, c; int n;
		cout << "Введите направление робота" << endl;
		cin >> c;
		cout << "Введите команду робота" << endl;
		cin >> n;
		if (c == C[0]) {
			switch (n) {
			case 0: {
				cout << "Робот продолжает движение на север" << endl;
			}break;
			case 1: {
				cout << "Робот поворачивает налево на север" << endl;
			}break;
			case (-1): {
				cout << "Робот поворачивает направо на север" << endl;
			}
			}
		}
		if (c == C[1]) {
			switch (n) {
			case 0: {
				cout << "Робот продолжает движение на запад" << endl;
			}break;
			case 1: {
				cout << "Робот поворачивает налево на запад" << endl;
			}break;
			case (-1): {
				cout << "Робот поворачивает направо на запад" << endl;
			}
			}
		}
		if (c == C[2]) {
			switch (n) {
			case 0: {
				cout << "Робот продолжает движение на юг" << endl;
			}break;
			case 1: {
				cout << "Робот поворачивает налево на юг" << endl;
			}break;
			case (-1): {
				cout << "Робот поворачивает направо на юг" << endl;
			}
			}
		}
		if (c == C[3]) {
			switch (n) {
			case 0: {
				cout << "Робот продолжает движение на восток" << endl;
			}break;
			case 1: {
				cout << "Робот поворачивает налево на восток" << endl;
			}break;
			case (-1): {
				cout << "Робот поворачивает направо на восток" << endl;
			}
			}
		}
		else {
			cout << "ошибка" << endl;
		}
	}
	case 3: {
		/*Дано целое число в диапазоне 10–40, определяющее количество учебных заданий по некоторой теме.
		Вывести строку-описание указанного количества заданий,
		обеспечив правильное согласование числа со словами «учебное задание»,
		например: 18 — «восемнадцать учебных заданий».*/

		int a;
		cout << "Введите номер учебного задания" << endl;
		cin >> a;
		if (10 <= a && a <= 40) {
			if (a / 10 == 1) {
				switch (a) {
				case 10: cout << "десять учебных заданий" << endl;
				case 11: cout << "однадцать учебных заданий" << endl;
				case 12: cout << "двенадцать учебных заданий" << endl;
				case 13: cout << "Тринадцать учебных заданий" << endl;
				case 14: cout << "четырнадцать учебных заданий" << endl;
				case 15: cout << "пятнадцать учебных заданий" << endl;
				case 16: cout << "шестнадцать учебных заданий" << endl;
				case 17: cout << "семнадцать учебных заданий" << endl;
				case 18: cout << "восемнадцать учебных заданий" << endl;
				case 19: cout << "девятнадцать учебных заданий" << endl;
				}break;
			}
			switch (a / 10) {
			case 2: cout << "двадцать " << endl;
			case 3: cout << "тридцать " << endl;
			case 4: cout << "сорок " << endl;
			}break;

			switch (a % 10) {
			case 1: cout << "одно " << endl;
			case 2: cout << "два " << endl;
			case 3: cout << "три " << endl;
			case 4: cout << "четыре " << endl;
			case 5: cout << "пять " << endl;
			case 6: cout << "шесть " << endl;
			case 7: cout << "семь " << endl;
			case 8: cout << "восемь " << endl;
			case 9: cout << "девять " << endl;

			}break;
			switch (a % 10) {
			case 0: cout << "учебных заданий" << endl;
			case 1: cout << "учебное адание" << endl;
			case 2: cout << "учебных задания" << endl;
			case 3: cout << "учебных задания" << endl;
			case 4: cout << "учебных задания" << endl;
			case 5: cout << "учебных заданий" << endl;
			case 6: cout << "учебных заданий" << endl;
			case 7: cout << "учебных заданий" << endl;
			case 8: cout << "учебных заданий" << endl;
			case 9: cout << "учебных заданий" << endl;

			}break;
		}

	}
	}

			return 0;
	}